{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "batch_input_shape": [null, 1000], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "relu", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "trainable": true, "activity_regularizer": null, "units": 512}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "sigmoid", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "units": 256}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_3", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "softmax", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "units": 2}}], "name": "sequential_1"}}